Ai-Thinker-Open/Ai-Thinker-Open-TG7100C_SDK/Living_SDK/platform/mcu/bk7231u/beken/driver/common/reg/reg_mdm_stat.h
    *fdsymbolnr = (localVal & ((uint32_t)0xFFFF0000)) >> 16;
    *tdsymbolnr = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

/**
 * @brief Returns the current value of the FDSYMBOLNR field in the RXFSMSTAT0 register.
 *
 * The RXFSMSTAT0 register will be read and the FDSYMBOLNR field's value will be returned.
 *
 * @return The current value of the FDSYMBOLNR field in the RXFSMSTAT0 register.
 */
__INLINE uint16_t mdm_fdsymbolnr_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXFSMSTAT0_ADDR);
    return ((localVal & ((uint32_t)0xFFFF0000)) >> 16);
}

/**
 * @brief Returns the current value of the TDSYMBOLNR field in the RXFSMSTAT0 register.
 *
 * The RXFSMSTAT0 register will be read and the TDSYMBOLNR field's value will be returned.
 *
 * @return The current value of the TDSYMBOLNR field in the RXFSMSTAT0 register.
 */
__INLINE uint16_t mdm_tdsymbolnr_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXFSMSTAT0_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

/// @}

/**
 * @name RXFSMSTAT1 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24              FDSTATE   0x0
 *  21:16             GILENGTH   0x0
 *     13               STBCEN   0
 *  11:10              TDBWREG   0x0
 *  09:08              FDBWREG   0x0
 *  06:04           RXMODESTAT   0x0
 *  02:00         FDSYMBOLTYPE   0x0
 * </pre>
 *
 * @{
 */

/// Address of the RXFSMSTAT1 register
#define MDM_RXFSMSTAT1_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000018)
/// Offset of the RXFSMSTAT1 register from the base address
#define MDM_RXFSMSTAT1_OFFSET 0x00000018
/// Index of the RXFSMSTAT1 register
#define MDM_RXFSMSTAT1_INDEX  0x00000006
/// Reset value of the RXFSMSTAT1 register
#define MDM_RXFSMSTAT1_RESET  0x00000000

/**
 * @brief Returns the current value of the RXFSMSTAT1 register.
 * The RXFSMSTAT1 register will be read and its value returned.
 * @return The current value of the RXFSMSTAT1 register.
 */
__INLINE uint32_t mdm_rxfsmstat1_get(void)
{
    return REG_PL_RD(MDM_RXFSMSTAT1_ADDR);
}

// field definitions
/// FDSTATE field mask
#define MDM_FDSTATE_MASK        ((uint32_t)0xFF000000)
/// FDSTATE field LSB position
#define MDM_FDSTATE_LSB         24
/// FDSTATE field width
#define MDM_FDSTATE_WIDTH       ((uint32_t)0x00000008)
/// GILENGTH field mask
#define MDM_GILENGTH_MASK       ((uint32_t)0x003F0000)
/// GILENGTH field LSB position
#define MDM_GILENGTH_LSB        16
/// GILENGTH field width
#define MDM_GILENGTH_WIDTH      ((uint32_t)0x00000006)
/// STBCEN field bit
#define MDM_STBCEN_BIT          ((uint32_t)0x00002000)
/// STBCEN field position
#define MDM_STBCEN_POS          13
/// TDBWREG field mask
#define MDM_TDBWREG_MASK        ((uint32_t)0x00000C00)
/// TDBWREG field LSB position
#define MDM_TDBWREG_LSB         10
/// TDBWREG field width
#define MDM_TDBWREG_WIDTH       ((uint32_t)0x00000002)
/// FDBWREG field mask
#define MDM_FDBWREG_MASK        ((uint32_t)0x00000300)
/// FDBWREG field LSB position
#define MDM_FDBWREG_LSB         8
/// FDBWREG field width
#define MDM_FDBWREG_WIDTH       ((uint32_t)0x00000002)
/// RXMODESTAT field mask
#define MDM_RXMODESTAT_MASK     ((uint32_t)0x00000070)
/// RXMODESTAT field LSB position
#define MDM_RXMODESTAT_LSB      4
/// RXMODESTAT field width
#define MDM_RXMODESTAT_WIDTH    ((uint32_t)0x00000003)
/// FDSYMBOLTYPE field mask
#define MDM_FDSYMBOLTYPE_MASK   ((uint32_t)0x00000007)
/// FDSYMBOLTYPE field LSB position
#define MDM_FDSYMBOLTYPE_LSB    0
/// FDSYMBOLTYPE field width
#define MDM_FDSYMBOLTYPE_WIDTH  ((uint32_t)0x00000003)

/// FDSTATE field reset value
#define MDM_FDSTATE_RST         0x0
/// GILENGTH field reset value
#define MDM_GILENGTH_RST        0x0
/// STBCEN field reset value
#define MDM_STBCEN_RST          0x0
/// TDBWREG field reset value
#define MDM_TDBWREG_RST         0x0
/// FDBWREG field reset value
#define MDM_FDBWREG_RST         0x0
/// RXMODESTAT field reset value
#define MDM_RXMODESTAT_RST      0x0
/// FDSYMBOLTYPE field reset value
#define MDM_FDSYMBOLTYPE_RST    0x0

/**
 * @brief Unpacks RXFSMSTAT1's fields from current value of the RXFSMSTAT1 register.
 *
 * Reads the RXFSMSTAT1 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] fdstate - Will be populated with the current value of this field from the register.
 * @param[out] gilength - Will be populated with the current value of this field from the register.
 * @param[out] stbcen - Will be populated with the current value of this field from the register.
 * @param[out] tdbwreg - Will be populated with the current value of this field from the register.
 * @param[out] fdbwreg - Will be populated with the current value of this field from the register.
 * @param[out] rxmodestat - Will be populated with the current value of this field from the register.
 * @param[out] fdsymboltype - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_rxfsmstat1_unpack(uint8_t *fdstate, uint8_t *gilength, uint8_t *stbcen, uint8_t *tdbwreg, uint8_t *fdbwreg, uint8_t *rxmodestat, uint8_t *fdsymboltype)
{
    uint32_t localVal = REG_PL_RD(MDM_RXFSMSTAT1_ADDR);

    *fdstate = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *gilength = (localVal & ((uint32_t)0x003F0000)) >> 16;
    *stbcen = (localVal & ((uint32_t)0x00002000)) >> 13;
    *tdbwreg = (localVal & ((uint32_t)0x00000C00)) >> 10;
    *fdbwreg = (localVal & ((uint32_t)0x00000300)) >> 8;
    *rxmodestat = (localVal & ((uint32_t)0x00000070)) >> 4;
    *fdsymboltype = (localVal & ((uint32_t)0x00000007)) >> 0;
}

/**
 * @brief Returns the current value of the FDSTATE field in the RXFSMSTAT1 register.
 *
 * The RXFSMSTAT1 register will be read and the FDSTATE field's value will be returned.
 *
 * @return The current value of the FDSTATE field in the RXFSMSTAT1 register.
 */
__INLINE uint8_t mdm_fdstate_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXFSMSTAT1_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

/**
 * @brief Returns the current value of the GILENGTH field in the RXFSMSTAT1 register.
 *
 * The RXFSMSTAT1 register will be read and the GILENGTH field's value will be returned.
 *
 * @return The current value of the GILENGTH field in the RXFSMSTAT1 register.
 */
__INLINE uint8_t mdm_gilength_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXFSMSTAT1_ADDR);
    return ((localVal & ((uint32_t)0x003F0000)) >> 16);
}

/**
 * @brief Returns the current value of the STBCEN field in the RXFSMSTAT1 register.
 *
 * The RXFSMSTAT1 register will be read and the STBCEN field's value will be returned.
 *
 * @return The current value of the STBCEN field in the RXFSMSTAT1 register.
 */
__INLINE uint8_t mdm_stbcen_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXFSMSTAT1_ADDR);
    return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

/**
 * @brief Returns the current value of the TDBWREG field in the RXFSMSTAT1 register.
 *
 * The RXFSMSTAT1 register will be read and the TDBWREG field's value will be returned.
 *
 * @return The current value of the TDBWREG field in the RXFSMSTAT1 register.
 */
__INLINE uint8_t mdm_tdbwreg_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXFSMSTAT1_ADDR);
    return ((localVal & ((uint32_t)0x00000C00)) >> 10);
}

/**
 * @brief Returns the current value of the FDBWREG field in the RXFSMSTAT1 register.
 *
 * The RXFSMSTAT1 register will be read and the FDBWREG field's value will be returned.
 *
 * @return The current value of the FDBWREG field in the RXFSMSTAT1 register.
 */
__INLINE uint8_t mdm_fdbwreg_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXFSMSTAT1_ADDR);
    return ((localVal & ((uint32_t)0x00000300)) >> 8);
}

/**
 * @brief Returns the current value of the RXMODESTAT field in the RXFSMSTAT1 register.
 *
 * The RXFSMSTAT1 register will be read and the RXMODESTAT field's value will be returned.
 *
 * @return The current value of the RXMODESTAT field in the RXFSMSTAT1 register.
 */
__INLINE uint8_t mdm_rxmodestat_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXFSMSTAT1_ADDR);
    return ((localVal & ((uint32_t)0x00000070)) >> 4);
}

/**
 * @brief Returns the current value of the FDSYMBOLTYPE field in the RXFSMSTAT1 register.
 *
 * The RXFSMSTAT1 register will be read and the FDSYMBOLTYPE field's value will be returned.
 *
 * @return The current value of the FDSYMBOLTYPE field in the RXFSMSTAT1 register.
 */
__INLINE uint8_t mdm_fdsymboltype_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXFSMSTAT1_ADDR);
    return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

/// @}

/**
 * @name TXFSMSTAT1 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     00       PhyTxAbortStat   0
 * </pre>
 *
 * @{
 */

/// Address of the TXFSMSTAT1 register
#define MDM_TXFSMSTAT1_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x0000001C)
/// Offset of the TXFSMSTAT1 register from the base address
#define MDM_TXFSMSTAT1_OFFSET 0x0000001C
/// Index of the TXFSMSTAT1 register
#define MDM_TXFSMSTAT1_INDEX  0x00000007
/// Reset value of the TXFSMSTAT1 register
#define MDM_TXFSMSTAT1_RESET  0x00000000

/**
 * @brief Returns the current value of the TXFSMSTAT1 register.
 * The TXFSMSTAT1 register will be read and its value returned.
 * @return The current value of the TXFSMSTAT1 register.
 */
__INLINE uint32_t mdm_txfsmstat1_get(void)
{
    return REG_PL_RD(MDM_TXFSMSTAT1_ADDR);
}

