Ai-Thinker-Open/Ai-Thinker-Open-TG7100C_SDK/Living_SDK/platform/mcu/bk7231u/beken/driver/common/reg/reg_mdm_stat.h
/// Address of the RXVECTOR0 register
#define MDM_RXVECTOR0_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000028)
/// Offset of the RXVECTOR0 register from the base address
#define MDM_RXVECTOR0_OFFSET 0x00000028
/// Index of the RXVECTOR0 register
#define MDM_RXVECTOR0_INDEX  0x0000000A
/// Reset value of the RXVECTOR0 register
#define MDM_RXVECTOR0_RESET  0x00000000

/**
 * @brief Returns the current value of the RXVECTOR0 register.
 * The RXVECTOR0 register will be read and its value returned.
 * @return The current value of the RXVECTOR0 register.
 */
__INLINE uint32_t mdm_rxvector0_get(void)
{
    return REG_PL_RD(MDM_RXVECTOR0_ADDR);
}

// field definitions
/// RXLEGRATE field mask
#define MDM_RXLEGRATE_MASK     ((uint32_t)0x0000F000)
/// RXLEGRATE field LSB position
#define MDM_RXLEGRATE_LSB      12
/// RXLEGRATE field width
#define MDM_RXLEGRATE_WIDTH    ((uint32_t)0x00000004)
/// RXLEGLENGTH field mask
#define MDM_RXLEGLENGTH_MASK   ((uint32_t)0x00000FFF)
/// RXLEGLENGTH field LSB position
#define MDM_RXLEGLENGTH_LSB    0
/// RXLEGLENGTH field width
#define MDM_RXLEGLENGTH_WIDTH  ((uint32_t)0x0000000C)

/// RXLEGRATE field reset value
#define MDM_RXLEGRATE_RST      0x0
/// RXLEGLENGTH field reset value
#define MDM_RXLEGLENGTH_RST    0x0

/**
 * @brief Unpacks RXVECTOR0's fields from current value of the RXVECTOR0 register.
 *
 * Reads the RXVECTOR0 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] rxlegrate - Will be populated with the current value of this field from the register.
 * @param[out] rxleglength - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_rxvector0_unpack(uint8_t *rxlegrate, uint16_t *rxleglength)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR0_ADDR);

    *rxlegrate = (localVal & ((uint32_t)0x0000F000)) >> 12;
    *rxleglength = (localVal & ((uint32_t)0x00000FFF)) >> 0;
}

/**
 * @brief Returns the current value of the RXLEGRATE field in the RXVECTOR0 register.
 *
 * The RXVECTOR0 register will be read and the RXLEGRATE field's value will be returned.
 *
 * @return The current value of the RXLEGRATE field in the RXVECTOR0 register.
 */
__INLINE uint8_t mdm_rxlegrate_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR0_ADDR);
    return ((localVal & ((uint32_t)0x0000F000)) >> 12);
}

/**
 * @brief Returns the current value of the RXLEGLENGTH field in the RXVECTOR0 register.
 *
 * The RXVECTOR0 register will be read and the RXLEGLENGTH field's value will be returned.
 *
 * @return The current value of the RXLEGLENGTH field in the RXVECTOR0 register.
 */
__INLINE uint16_t mdm_rxleglength_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR0_ADDR);
    return ((localVal & ((uint32_t)0x00000FFF)) >> 0);
}

/// @}

/**
 * @name RXVECTOR1 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31            RXPRETYPE   0
 *  30:24                RXMCS   0x0
 *     23          RXSMOOTHING   0
 *  22:21               RXSTBC   0x0
 *     20            RXSHORTGI   0
 *  19:00           RXHTLENGTH   0x0
 * </pre>
 *
 * @{
 */

/// Address of the RXVECTOR1 register
#define MDM_RXVECTOR1_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x0000002C)
/// Offset of the RXVECTOR1 register from the base address
#define MDM_RXVECTOR1_OFFSET 0x0000002C
/// Index of the RXVECTOR1 register
#define MDM_RXVECTOR1_INDEX  0x0000000B
/// Reset value of the RXVECTOR1 register
#define MDM_RXVECTOR1_RESET  0x00000000

/**
 * @brief Returns the current value of the RXVECTOR1 register.
 * The RXVECTOR1 register will be read and its value returned.
 * @return The current value of the RXVECTOR1 register.
 */
__INLINE uint32_t mdm_rxvector1_get(void)
{
    return REG_PL_RD(MDM_RXVECTOR1_ADDR);
}

// field definitions
/// RXPRETYPE field bit
#define MDM_RXPRETYPE_BIT      ((uint32_t)0x80000000)
/// RXPRETYPE field position
#define MDM_RXPRETYPE_POS      31
/// RXMCS field mask
#define MDM_RXMCS_MASK         ((uint32_t)0x7F000000)
/// RXMCS field LSB position
#define MDM_RXMCS_LSB          24
/// RXMCS field width
#define MDM_RXMCS_WIDTH        ((uint32_t)0x00000007)
/// RXSMOOTHING field bit
#define MDM_RXSMOOTHING_BIT    ((uint32_t)0x00800000)
/// RXSMOOTHING field position
#define MDM_RXSMOOTHING_POS    23
/// RXSTBC field mask
#define MDM_RXSTBC_MASK        ((uint32_t)0x00600000)
/// RXSTBC field LSB position
#define MDM_RXSTBC_LSB         21
/// RXSTBC field width
#define MDM_RXSTBC_WIDTH       ((uint32_t)0x00000002)
/// RXSHORTGI field bit
#define MDM_RXSHORTGI_BIT      ((uint32_t)0x00100000)
/// RXSHORTGI field position
#define MDM_RXSHORTGI_POS      20
/// RXHTLENGTH field mask
#define MDM_RXHTLENGTH_MASK    ((uint32_t)0x000FFFFF)
/// RXHTLENGTH field LSB position
#define MDM_RXHTLENGTH_LSB     0
/// RXHTLENGTH field width
#define MDM_RXHTLENGTH_WIDTH   ((uint32_t)0x00000014)

/// RXPRETYPE field reset value
#define MDM_RXPRETYPE_RST      0x0
/// RXMCS field reset value
#define MDM_RXMCS_RST          0x0
/// RXSMOOTHING field reset value
#define MDM_RXSMOOTHING_RST    0x0
/// RXSTBC field reset value
#define MDM_RXSTBC_RST         0x0
/// RXSHORTGI field reset value
#define MDM_RXSHORTGI_RST      0x0
/// RXHTLENGTH field reset value
#define MDM_RXHTLENGTH_RST     0x0

/**
 * @brief Unpacks RXVECTOR1's fields from current value of the RXVECTOR1 register.
 *
 * Reads the RXVECTOR1 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] rxpretype - Will be populated with the current value of this field from the register.
 * @param[out] rxmcs - Will be populated with the current value of this field from the register.
 * @param[out] rxsmoothing - Will be populated with the current value of this field from the register.
 * @param[out] rxstbc - Will be populated with the current value of this field from the register.
 * @param[out] rxshortgi - Will be populated with the current value of this field from the register.
 * @param[out] rxhtlength - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_rxvector1_unpack(uint8_t *rxpretype, uint8_t *rxmcs, uint8_t *rxsmoothing, uint8_t *rxstbc, uint8_t *rxshortgi, uint32_t *rxhtlength)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR1_ADDR);

    *rxpretype = (localVal & ((uint32_t)0x80000000)) >> 31;
    *rxmcs = (localVal & ((uint32_t)0x7F000000)) >> 24;
    *rxsmoothing = (localVal & ((uint32_t)0x00800000)) >> 23;
    *rxstbc = (localVal & ((uint32_t)0x00600000)) >> 21;
    *rxshortgi = (localVal & ((uint32_t)0x00100000)) >> 20;
    *rxhtlength = (localVal & ((uint32_t)0x000FFFFF)) >> 0;
}

/**
 * @brief Returns the current value of the RXPRETYPE field in the RXVECTOR1 register.
 *
 * The RXVECTOR1 register will be read and the RXPRETYPE field's value will be returned.
 *
 * @return The current value of the RXPRETYPE field in the RXVECTOR1 register.
 */
__INLINE uint8_t mdm_rxpretype_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR1_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

/**
 * @brief Returns the current value of the RXMCS field in the RXVECTOR1 register.
 *
 * The RXVECTOR1 register will be read and the RXMCS field's value will be returned.
 *
 * @return The current value of the RXMCS field in the RXVECTOR1 register.
 */
__INLINE uint8_t mdm_rxmcs_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR1_ADDR);
    return ((localVal & ((uint32_t)0x7F000000)) >> 24);
}

/**
 * @brief Returns the current value of the RXSMOOTHING field in the RXVECTOR1 register.
 *
 * The RXVECTOR1 register will be read and the RXSMOOTHING field's value will be returned.
 *
 * @return The current value of the RXSMOOTHING field in the RXVECTOR1 register.
 */
__INLINE uint8_t mdm_rxsmoothing_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR1_ADDR);
    return ((localVal & ((uint32_t)0x00800000)) >> 23);
}

/**
 * @brief Returns the current value of the RXSTBC field in the RXVECTOR1 register.
 *
 * The RXVECTOR1 register will be read and the RXSTBC field's value will be returned.
 *
 * @return The current value of the RXSTBC field in the RXVECTOR1 register.
 */
__INLINE uint8_t mdm_rxstbc_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR1_ADDR);
    return ((localVal & ((uint32_t)0x00600000)) >> 21);
}

/**
 * @brief Returns the current value of the RXSHORTGI field in the RXVECTOR1 register.
 *
 * The RXVECTOR1 register will be read and the RXSHORTGI field's value will be returned.
 *
 * @return The current value of the RXSHORTGI field in the RXVECTOR1 register.
 */
__INLINE uint8_t mdm_rxshortgi_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR1_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

/**
 * @brief Returns the current value of the RXHTLENGTH field in the RXVECTOR1 register.
 *
 * The RXVECTOR1 register will be read and the RXHTLENGTH field's value will be returned.
 *
 * @return The current value of the RXHTLENGTH field in the RXVECTOR1 register.
 */
__INLINE uint32_t mdm_rxhtlength_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR1_ADDR);
    return ((localVal & ((uint32_t)0x000FFFFF)) >> 0);
}

/// @}

/**
 * @name RXVECTOR2 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24         RXANTENNASET   0x0
 *     23     RXDOZENOTALLOWED   0
 *     22              RXDYNBW   0
 *     21          RXFECCODING   0
 *     20             RXAGGREG   0
 *  17:16           RXNUMEXTSS   0x0
 *     12           RXSOUNDING   0
 *  10:08             RXNUMSTS   0x0
 *  05:04               RXCHBW   0x0
 *  02:00             RXFORMAT   0x0
 * </pre>
 *
 * @{
 */

/// Address of the RXVECTOR2 register
#define MDM_RXVECTOR2_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000030)
/// Offset of the RXVECTOR2 register from the base address
#define MDM_RXVECTOR2_OFFSET 0x00000030
/// Index of the RXVECTOR2 register
#define MDM_RXVECTOR2_INDEX  0x0000000C
/// Reset value of the RXVECTOR2 register
#define MDM_RXVECTOR2_RESET  0x00000000

/**
 * @brief Returns the current value of the RXVECTOR2 register.
 * The RXVECTOR2 register will be read and its value returned.
 * @return The current value of the RXVECTOR2 register.
 */
__INLINE uint32_t mdm_rxvector2_get(void)
{
    return REG_PL_RD(MDM_RXVECTOR2_ADDR);
}

