Ai-Thinker-Open/Ai-Thinker-Open-TG7100C_SDK/Living_SDK/platform/mcu/bk7231u/beken/driver/common/reg/reg_mdm_stat.h
// field definitions
/// RXANTENNASET field mask
#define MDM_RXANTENNASET_MASK       ((uint32_t)0xFF000000)
/// RXANTENNASET field LSB position
#define MDM_RXANTENNASET_LSB        24
/// RXANTENNASET field width
#define MDM_RXANTENNASET_WIDTH      ((uint32_t)0x00000008)
/// RXDOZENOTALLOWED field bit
#define MDM_RXDOZENOTALLOWED_BIT    ((uint32_t)0x00800000)
/// RXDOZENOTALLOWED field position
#define MDM_RXDOZENOTALLOWED_POS    23
/// RXDYNBW field bit
#define MDM_RXDYNBW_BIT             ((uint32_t)0x00400000)
/// RXDYNBW field position
#define MDM_RXDYNBW_POS             22
/// RXFECCODING field bit
#define MDM_RXFECCODING_BIT         ((uint32_t)0x00200000)
/// RXFECCODING field position
#define MDM_RXFECCODING_POS         21
/// RXAGGREG field bit
#define MDM_RXAGGREG_BIT            ((uint32_t)0x00100000)
/// RXAGGREG field position
#define MDM_RXAGGREG_POS            20
/// RXNUMEXTSS field mask
#define MDM_RXNUMEXTSS_MASK         ((uint32_t)0x00030000)
/// RXNUMEXTSS field LSB position
#define MDM_RXNUMEXTSS_LSB          16
/// RXNUMEXTSS field width
#define MDM_RXNUMEXTSS_WIDTH        ((uint32_t)0x00000002)
/// RXSOUNDING field bit
#define MDM_RXSOUNDING_BIT          ((uint32_t)0x00001000)
/// RXSOUNDING field position
#define MDM_RXSOUNDING_POS          12
/// RXNUMSTS field mask
#define MDM_RXNUMSTS_MASK           ((uint32_t)0x00000700)
/// RXNUMSTS field LSB position
#define MDM_RXNUMSTS_LSB            8
/// RXNUMSTS field width
#define MDM_RXNUMSTS_WIDTH          ((uint32_t)0x00000003)
/// RXCHBW field mask
#define MDM_RXCHBW_MASK             ((uint32_t)0x00000030)
/// RXCHBW field LSB position
#define MDM_RXCHBW_LSB              4
/// RXCHBW field width
#define MDM_RXCHBW_WIDTH            ((uint32_t)0x00000002)
/// RXFORMAT field mask
#define MDM_RXFORMAT_MASK           ((uint32_t)0x00000007)
/// RXFORMAT field LSB position
#define MDM_RXFORMAT_LSB            0
/// RXFORMAT field width
#define MDM_RXFORMAT_WIDTH          ((uint32_t)0x00000003)

/// RXANTENNASET field reset value
#define MDM_RXANTENNASET_RST        0x0
/// RXDOZENOTALLOWED field reset value
#define MDM_RXDOZENOTALLOWED_RST    0x0
/// RXDYNBW field reset value
#define MDM_RXDYNBW_RST             0x0
/// RXFECCODING field reset value
#define MDM_RXFECCODING_RST         0x0
/// RXAGGREG field reset value
#define MDM_RXAGGREG_RST            0x0
/// RXNUMEXTSS field reset value
#define MDM_RXNUMEXTSS_RST          0x0
/// RXSOUNDING field reset value
#define MDM_RXSOUNDING_RST          0x0
/// RXNUMSTS field reset value
#define MDM_RXNUMSTS_RST            0x0
/// RXCHBW field reset value
#define MDM_RXCHBW_RST              0x0
/// RXFORMAT field reset value
#define MDM_RXFORMAT_RST            0x0

/**
 * @brief Unpacks RXVECTOR2's fields from current value of the RXVECTOR2 register.
 *
 * Reads the RXVECTOR2 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] rxantennaset - Will be populated with the current value of this field from the register.
 * @param[out] rxdozenotallowed - Will be populated with the current value of this field from the register.
 * @param[out] rxdynbw - Will be populated with the current value of this field from the register.
 * @param[out] rxfeccoding - Will be populated with the current value of this field from the register.
 * @param[out] rxaggreg - Will be populated with the current value of this field from the register.
 * @param[out] rxnumextss - Will be populated with the current value of this field from the register.
 * @param[out] rxsounding - Will be populated with the current value of this field from the register.
 * @param[out] rxnumsts - Will be populated with the current value of this field from the register.
 * @param[out] rxchbw - Will be populated with the current value of this field from the register.
 * @param[out] rxformat - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_rxvector2_unpack(uint8_t *rxantennaset, uint8_t *rxdozenotallowed, uint8_t *rxdynbw, uint8_t *rxfeccoding, uint8_t *rxaggreg, uint8_t *rxnumextss, uint8_t *rxsounding, uint8_t *rxnumsts, uint8_t *rxchbw, uint8_t *rxformat)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR2_ADDR);

    *rxantennaset = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *rxdozenotallowed = (localVal & ((uint32_t)0x00800000)) >> 23;
    *rxdynbw = (localVal & ((uint32_t)0x00400000)) >> 22;
    *rxfeccoding = (localVal & ((uint32_t)0x00200000)) >> 21;
    *rxaggreg = (localVal & ((uint32_t)0x00100000)) >> 20;
    *rxnumextss = (localVal & ((uint32_t)0x00030000)) >> 16;
    *rxsounding = (localVal & ((uint32_t)0x00001000)) >> 12;
    *rxnumsts = (localVal & ((uint32_t)0x00000700)) >> 8;
    *rxchbw = (localVal & ((uint32_t)0x00000030)) >> 4;
    *rxformat = (localVal & ((uint32_t)0x00000007)) >> 0;
}

/**
 * @brief Returns the current value of the RXANTENNASET field in the RXVECTOR2 register.
 *
 * The RXVECTOR2 register will be read and the RXANTENNASET field's value will be returned.
 *
 * @return The current value of the RXANTENNASET field in the RXVECTOR2 register.
 */
__INLINE uint8_t mdm_rxantennaset_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

/**
 * @brief Returns the current value of the RXDOZENOTALLOWED field in the RXVECTOR2 register.
 *
 * The RXVECTOR2 register will be read and the RXDOZENOTALLOWED field's value will be returned.
 *
 * @return The current value of the RXDOZENOTALLOWED field in the RXVECTOR2 register.
 */
__INLINE uint8_t mdm_rxdozenotallowed_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0x00800000)) >> 23);
}

/**
 * @brief Returns the current value of the RXDYNBW field in the RXVECTOR2 register.
 *
 * The RXVECTOR2 register will be read and the RXDYNBW field's value will be returned.
 *
 * @return The current value of the RXDYNBW field in the RXVECTOR2 register.
 */
__INLINE uint8_t mdm_rxdynbw_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0x00400000)) >> 22);
}

/**
 * @brief Returns the current value of the RXFECCODING field in the RXVECTOR2 register.
 *
 * The RXVECTOR2 register will be read and the RXFECCODING field's value will be returned.
 *
 * @return The current value of the RXFECCODING field in the RXVECTOR2 register.
 */
__INLINE uint8_t mdm_rxfeccoding_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

/**
 * @brief Returns the current value of the RXAGGREG field in the RXVECTOR2 register.
 *
 * The RXVECTOR2 register will be read and the RXAGGREG field's value will be returned.
 *
 * @return The current value of the RXAGGREG field in the RXVECTOR2 register.
 */
__INLINE uint8_t mdm_rxaggreg_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

/**
 * @brief Returns the current value of the RXNUMEXTSS field in the RXVECTOR2 register.
 *
 * The RXVECTOR2 register will be read and the RXNUMEXTSS field's value will be returned.
 *
 * @return The current value of the RXNUMEXTSS field in the RXVECTOR2 register.
 */
__INLINE uint8_t mdm_rxnumextss_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0x00030000)) >> 16);
}

/**
 * @brief Returns the current value of the RXSOUNDING field in the RXVECTOR2 register.
 *
 * The RXVECTOR2 register will be read and the RXSOUNDING field's value will be returned.
 *
 * @return The current value of the RXSOUNDING field in the RXVECTOR2 register.
 */
__INLINE uint8_t mdm_rxsounding_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

/**
 * @brief Returns the current value of the RXNUMSTS field in the RXVECTOR2 register.
 *
 * The RXVECTOR2 register will be read and the RXNUMSTS field's value will be returned.
 *
 * @return The current value of the RXNUMSTS field in the RXVECTOR2 register.
 */
__INLINE uint8_t mdm_rxnumsts_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0x00000700)) >> 8);
}

/**
 * @brief Returns the current value of the RXCHBW field in the RXVECTOR2 register.
 *
 * The RXVECTOR2 register will be read and the RXCHBW field's value will be returned.
 *
 * @return The current value of the RXCHBW field in the RXVECTOR2 register.
 */
__INLINE uint8_t mdm_rxchbw_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0x00000030)) >> 4);
}

/**
 * @brief Returns the current value of the RXFORMAT field in the RXVECTOR2 register.
 *
 * The RXVECTOR2 register will be read and the RXFORMAT field's value will be returned.
 *
 * @return The current value of the RXFORMAT field in the RXVECTOR2 register.
 */
__INLINE uint8_t mdm_rxformat_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RXVECTOR2_ADDR);
    return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

/// @}

/**
 * @name RXVECTOR3 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24                RSSI4   0x0
 *  23:16                RSSI3   0x0
 *  15:08                RSSI2   0x0
 *  07:00                RSSI1   0x0
 * </pre>
 *
 * @{
 */

/// Address of the RXVECTOR3 register
#define MDM_RXVECTOR3_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000034)
/// Offset of the RXVECTOR3 register from the base address
#define MDM_RXVECTOR3_OFFSET 0x00000034
/// Index of the RXVECTOR3 register
#define MDM_RXVECTOR3_INDEX  0x0000000D
/// Reset value of the RXVECTOR3 register
#define MDM_RXVECTOR3_RESET  0x00000000

/**
 * @brief Returns the current value of the RXVECTOR3 register.
 * The RXVECTOR3 register will be read and its value returned.
 * @return The current value of the RXVECTOR3 register.
 */
__INLINE uint32_t mdm_rxvector3_get(void)
{
    return REG_PL_RD(MDM_RXVECTOR3_ADDR);
}

