Ai-Thinker-Open/Ai-Thinker-Open-TG7100C_SDK/Living_SDK/platform/mcu/bk7231u/beken/driver/common/reg/reg_mdm_stat.h
// field definitions
/// TXSTBC field mask
#define MDM_TXSTBC_MASK             ((uint32_t)0x30000000)
/// TXSTBC field LSB position
#define MDM_TXSTBC_LSB              28
/// TXSTBC field width
#define MDM_TXSTBC_WIDTH            ((uint32_t)0x00000002)
/// NTX field mask
#define MDM_NTX_MASK                ((uint32_t)0x07000000)
/// NTX field LSB position
#define MDM_NTX_LSB                 24
/// NTX field width
#define MDM_NTX_WIDTH               ((uint32_t)0x00000003)
/// TXSHORTGI field bit
#define MDM_TXSHORTGI_BIT           ((uint32_t)0x00400000)
/// TXSHORTGI field position
#define MDM_TXSHORTGI_POS           22
/// TXDOZENOTALLOWED field bit
#define MDM_TXDOZENOTALLOWED_BIT    ((uint32_t)0x00200000)
/// TXDOZENOTALLOWED field position
#define MDM_TXDOZENOTALLOWED_POS    21
/// TXAGGREG field bit
#define MDM_TXAGGREG_BIT            ((uint32_t)0x00100000)
/// TXAGGREG field position
#define MDM_TXAGGREG_POS            20
/// TXHTLENGTH field mask
#define MDM_TXHTLENGTH_MASK         ((uint32_t)0x000FFFFF)
/// TXHTLENGTH field LSB position
#define MDM_TXHTLENGTH_LSB          0
/// TXHTLENGTH field width
#define MDM_TXHTLENGTH_WIDTH        ((uint32_t)0x00000014)

/// TXSTBC field reset value
#define MDM_TXSTBC_RST              0x0
/// NTX field reset value
#define MDM_NTX_RST                 0x0
/// TXSHORTGI field reset value
#define MDM_TXSHORTGI_RST           0x0
/// TXDOZENOTALLOWED field reset value
#define MDM_TXDOZENOTALLOWED_RST    0x0
/// TXAGGREG field reset value
#define MDM_TXAGGREG_RST            0x0
/// TXHTLENGTH field reset value
#define MDM_TXHTLENGTH_RST          0x0

/**
 * @brief Unpacks TXVECTOR3's fields from current value of the TXVECTOR3 register.
 *
 * Reads the TXVECTOR3 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] txstbc - Will be populated with the current value of this field from the register.
 * @param[out] ntx - Will be populated with the current value of this field from the register.
 * @param[out] txshortgi - Will be populated with the current value of this field from the register.
 * @param[out] txdozenotallowed - Will be populated with the current value of this field from the register.
 * @param[out] txaggreg - Will be populated with the current value of this field from the register.
 * @param[out] txhtlength - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_txvector3_unpack(uint8_t *txstbc, uint8_t *ntx, uint8_t *txshortgi, uint8_t *txdozenotallowed, uint8_t *txaggreg, uint32_t *txhtlength)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR3_ADDR);

    *txstbc = (localVal & ((uint32_t)0x30000000)) >> 28;
    *ntx = (localVal & ((uint32_t)0x07000000)) >> 24;
    *txshortgi = (localVal & ((uint32_t)0x00400000)) >> 22;
    *txdozenotallowed = (localVal & ((uint32_t)0x00200000)) >> 21;
    *txaggreg = (localVal & ((uint32_t)0x00100000)) >> 20;
    *txhtlength = (localVal & ((uint32_t)0x000FFFFF)) >> 0;
}

/**
 * @brief Returns the current value of the TXSTBC field in the TXVECTOR3 register.
 *
 * The TXVECTOR3 register will be read and the TXSTBC field's value will be returned.
 *
 * @return The current value of the TXSTBC field in the TXVECTOR3 register.
 */
__INLINE uint8_t mdm_txstbc_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR3_ADDR);
    return ((localVal & ((uint32_t)0x30000000)) >> 28);
}

/**
 * @brief Returns the current value of the NTX field in the TXVECTOR3 register.
 *
 * The TXVECTOR3 register will be read and the NTX field's value will be returned.
 *
 * @return The current value of the NTX field in the TXVECTOR3 register.
 */
__INLINE uint8_t mdm_ntx_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR3_ADDR);
    return ((localVal & ((uint32_t)0x07000000)) >> 24);
}

/**
 * @brief Returns the current value of the TXSHORTGI field in the TXVECTOR3 register.
 *
 * The TXVECTOR3 register will be read and the TXSHORTGI field's value will be returned.
 *
 * @return The current value of the TXSHORTGI field in the TXVECTOR3 register.
 */
__INLINE uint8_t mdm_txshortgi_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR3_ADDR);
    return ((localVal & ((uint32_t)0x00400000)) >> 22);
}

/**
 * @brief Returns the current value of the TXDOZENOTALLOWED field in the TXVECTOR3 register.
 *
 * The TXVECTOR3 register will be read and the TXDOZENOTALLOWED field's value will be returned.
 *
 * @return The current value of the TXDOZENOTALLOWED field in the TXVECTOR3 register.
 */
__INLINE uint8_t mdm_txdozenotallowed_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR3_ADDR);
    return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

/**
 * @brief Returns the current value of the TXAGGREG field in the TXVECTOR3 register.
 *
 * The TXVECTOR3 register will be read and the TXAGGREG field's value will be returned.
 *
 * @return The current value of the TXAGGREG field in the TXVECTOR3 register.
 */
__INLINE uint8_t mdm_txaggreg_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR3_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

/**
 * @brief Returns the current value of the TXHTLENGTH field in the TXVECTOR3 register.
 *
 * The TXVECTOR3 register will be read and the TXHTLENGTH field's value will be returned.
 *
 * @return The current value of the TXHTLENGTH field in the TXVECTOR3 register.
 */
__INLINE uint32_t mdm_txhtlength_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TXVECTOR3_ADDR);
    return ((localVal & ((uint32_t)0x000FFFFF)) >> 0);
}

/// @}

/**
 * @name TXVECTOR4 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  17:12            TXGROUPID   0x0
 *  08:00         TXPARTIALAID   0x0
 * </pre>
 *
 * @{
 */

/// Address of the TXVECTOR4 register
#define MDM_TXVECTOR4_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000050)
/// Offset of the TXVECTOR4 register from the base address
#define MDM_TXVECTOR4_OFFSET 0x00000050
/// Index of the TXVECTOR4 register
#define MDM_TXVECTOR4_INDEX  0x00000014
/// Reset value of the TXVECTOR4 register
#define MDM_TXVECTOR4_RESET  0x00000000

/**
 * @brief Returns the current value of the TXVECTOR4 register.
 * The TXVECTOR4 register will be read and its value returned.
 * @return The current value of the TXVECTOR4 register.
 */
__INLINE uint32_t mdm_txvector4_get(void)
{
    return REG_PL_RD(MDM_TXVECTOR4_ADDR);
}

