Ai-Thinker-Open/Ai-Thinker-Open-TG7100C_SDK/Living_SDK/platform/mcu/bk7231u/beken/driver/common/reg/reg_mdm_stat.h
// field definitions
/// MIMOCMDP3 field mask
#define MDM_MIMOCMDP3_MASK   ((uint32_t)0xFF000000)
/// MIMOCMDP3 field LSB position
#define MDM_MIMOCMDP3_LSB    24
/// MIMOCMDP3 field width
#define MDM_MIMOCMDP3_WIDTH  ((uint32_t)0x00000008)
/// MIMOCMDP2 field mask
#define MDM_MIMOCMDP2_MASK   ((uint32_t)0x00FF0000)
/// MIMOCMDP2 field LSB position
#define MDM_MIMOCMDP2_LSB    16
/// MIMOCMDP2 field width
#define MDM_MIMOCMDP2_WIDTH  ((uint32_t)0x00000008)
/// MIMOCMDP1 field mask
#define MDM_MIMOCMDP1_MASK   ((uint32_t)0x0000FF00)
/// MIMOCMDP1 field LSB position
#define MDM_MIMOCMDP1_LSB    8
/// MIMOCMDP1 field width
#define MDM_MIMOCMDP1_WIDTH  ((uint32_t)0x00000008)
/// MIMOCMD field mask
#define MDM_MIMOCMD_MASK     ((uint32_t)0x000000FF)
/// MIMOCMD field LSB position
#define MDM_MIMOCMD_LSB      0
/// MIMOCMD field width
#define MDM_MIMOCMD_WIDTH    ((uint32_t)0x00000008)

/// MIMOCMDP3 field reset value
#define MDM_MIMOCMDP3_RST    0x0
/// MIMOCMDP2 field reset value
#define MDM_MIMOCMDP2_RST    0x0
/// MIMOCMDP1 field reset value
#define MDM_MIMOCMDP1_RST    0x0
/// MIMOCMD field reset value
#define MDM_MIMOCMD_RST      0x0

/**
 * @brief Unpacks MIMOCMDSTAT's fields from current value of the MIMOCMDSTAT register.
 *
 * Reads the MIMOCMDSTAT register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] mimocmdp3 - Will be populated with the current value of this field from the register.
 * @param[out] mimocmdp2 - Will be populated with the current value of this field from the register.
 * @param[out] mimocmdp1 - Will be populated with the current value of this field from the register.
 * @param[out] mimocmd - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_mimocmdstat_unpack(uint8_t *mimocmdp3, uint8_t *mimocmdp2, uint8_t *mimocmdp1, uint8_t *mimocmd)
{
    uint32_t localVal = REG_PL_RD(MDM_MIMOCMDSTAT_ADDR);

    *mimocmdp3 = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *mimocmdp2 = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *mimocmdp1 = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *mimocmd = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

/**
 * @brief Returns the current value of the MIMOCMDP3 field in the MIMOCMDSTAT register.
 *
 * The MIMOCMDSTAT register will be read and the MIMOCMDP3 field's value will be returned.
 *
 * @return The current value of the MIMOCMDP3 field in the MIMOCMDSTAT register.
 */
__INLINE uint8_t mdm_mimocmdp3_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_MIMOCMDSTAT_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

/**
 * @brief Returns the current value of the MIMOCMDP2 field in the MIMOCMDSTAT register.
 *
 * The MIMOCMDSTAT register will be read and the MIMOCMDP2 field's value will be returned.
 *
 * @return The current value of the MIMOCMDP2 field in the MIMOCMDSTAT register.
 */
__INLINE uint8_t mdm_mimocmdp2_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_MIMOCMDSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

/**
 * @brief Returns the current value of the MIMOCMDP1 field in the MIMOCMDSTAT register.
 *
 * The MIMOCMDSTAT register will be read and the MIMOCMDP1 field's value will be returned.
 *
 * @return The current value of the MIMOCMDP1 field in the MIMOCMDSTAT register.
 */
__INLINE uint8_t mdm_mimocmdp1_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_MIMOCMDSTAT_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

/**
 * @brief Returns the current value of the MIMOCMD field in the MIMOCMDSTAT register.
 *
 * The MIMOCMDSTAT register will be read and the MIMOCMD field's value will be returned.
 *
 * @return The current value of the MIMOCMD field in the MIMOCMDSTAT register.
 */
__INLINE uint8_t mdm_mimocmd_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_MIMOCMDSTAT_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/// @}

/**
 * @name TBESTAT0 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:08     TBEMaxCorrValSum   0x0
 *  07:00             TBECOUNT   0x0
 * </pre>
 *
 * @{
 */

/// Address of the TBESTAT0 register
#define MDM_TBESTAT0_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x0000005C)
/// Offset of the TBESTAT0 register from the base address
#define MDM_TBESTAT0_OFFSET 0x0000005C
/// Index of the TBESTAT0 register
#define MDM_TBESTAT0_INDEX  0x00000017
/// Reset value of the TBESTAT0 register
#define MDM_TBESTAT0_RESET  0x00000000

/**
 * @brief Returns the current value of the TBESTAT0 register.
 * The TBESTAT0 register will be read and its value returned.
 * @return The current value of the TBESTAT0 register.
 */
__INLINE uint32_t mdm_tbestat0_get(void)
{
    return REG_PL_RD(MDM_TBESTAT0_ADDR);
}

// field definitions
/// TBE_MAX_CORR_VAL_SUM field mask
#define MDM_TBE_MAX_CORR_VAL_SUM_MASK   ((uint32_t)0x00FFFF00)
/// TBE_MAX_CORR_VAL_SUM field LSB position
#define MDM_TBE_MAX_CORR_VAL_SUM_LSB    8
/// TBE_MAX_CORR_VAL_SUM field width
#define MDM_TBE_MAX_CORR_VAL_SUM_WIDTH  ((uint32_t)0x00000010)
/// TBECOUNT field mask
#define MDM_TBECOUNT_MASK               ((uint32_t)0x000000FF)
/// TBECOUNT field LSB position
#define MDM_TBECOUNT_LSB                0
/// TBECOUNT field width
#define MDM_TBECOUNT_WIDTH              ((uint32_t)0x00000008)

/// TBE_MAX_CORR_VAL_SUM field reset value
#define MDM_TBE_MAX_CORR_VAL_SUM_RST    0x0
/// TBECOUNT field reset value
#define MDM_TBECOUNT_RST                0x0

/**
 * @brief Unpacks TBESTAT0's fields from current value of the TBESTAT0 register.
 *
 * Reads the TBESTAT0 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] tbemaxcorrvalsum - Will be populated with the current value of this field from the register.
 * @param[out] tbecount - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_tbestat0_unpack(uint16_t *tbemaxcorrvalsum, uint8_t *tbecount)
{
    uint32_t localVal = REG_PL_RD(MDM_TBESTAT0_ADDR);

    *tbemaxcorrvalsum = (localVal & ((uint32_t)0x00FFFF00)) >> 8;
    *tbecount = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

/**
 * @brief Returns the current value of the TBEMaxCorrValSum field in the TBESTAT0 register.
 *
 * The TBESTAT0 register will be read and the TBEMaxCorrValSum field's value will be returned.
 *
 * @return The current value of the TBEMaxCorrValSum field in the TBESTAT0 register.
 */
__INLINE uint16_t mdm_tbe_max_corr_val_sum_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TBESTAT0_ADDR);
    return ((localVal & ((uint32_t)0x00FFFF00)) >> 8);
}

/**
 * @brief Returns the current value of the TBECOUNT field in the TBESTAT0 register.
 *
 * The TBESTAT0 register will be read and the TBECOUNT field's value will be returned.
 *
 * @return The current value of the TBECOUNT field in the TBESTAT0 register.
 */
__INLINE uint8_t mdm_tbecount_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_TBESTAT0_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/// @}

/**
 * @name AGCGAINSTAT register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:24             AGCGAIN3   0x0
 *  22:16             AGCGAIN2   0x0
 *  14:08             AGCGAIN1   0x0
 *  06:00             AGCGAIN0   0x0
 * </pre>
 *
 * @{
 */

/// Address of the AGCGAINSTAT register
#define MDM_AGCGAINSTAT_ADDR   (REG_MDM_STAT_BASE_ADDR + 0x00000060)
/// Offset of the AGCGAINSTAT register from the base address
#define MDM_AGCGAINSTAT_OFFSET 0x00000060
/// Index of the AGCGAINSTAT register
#define MDM_AGCGAINSTAT_INDEX  0x00000018
/// Reset value of the AGCGAINSTAT register
#define MDM_AGCGAINSTAT_RESET  0x00000000

/**
 * @brief Returns the current value of the AGCGAINSTAT register.
 * The AGCGAINSTAT register will be read and its value returned.
 * @return The current value of the AGCGAINSTAT register.
 */
__INLINE uint32_t mdm_agcgainstat_get(void)
{
    return REG_PL_RD(MDM_AGCGAINSTAT_ADDR);
}

